/**
 * @param {number} N
 * @return {boolean}
 */
//给定正整数 N ，我们按任何顺序（包括原始顺序）将数字重新排序，注意其前导数字不能为零。
//如果我们可以通过上述方式得到 2 的幂，返回 true；否则，返回 false
var reorderedPowerOf2 = function(N) {
    let rec =["1","2","4","8","16","23","46","128","256","125","0124","0248","0469","1289","13468",
                       "23678","35566","011237","122446","224588","0145678","0122579","0134449","0368888",
                       "11266777","23334455","01466788","112234778","234455668","012356789","0112344778"];
        let at = (N + "").split("");
        at.sort(function(x,y){return x - y;});
        if(rec.indexOf(at.join("")) != -1) return true;
        return false;
};
